In [3]:
import pandas as pd
import os
os.getcwd()

'/home/jian/BigLots/MediaStorm_2018-09-08'

In [4]:
weekly_data=pd.read_table("/home/jian/BigLots/MediaStorm_2018-09-08/MediaStormSalesWeekly20180911-121255-891.txt",nrows=100,sep="|")

In [5]:
weekly_data.head(2)

,location_id,week_end_dt,fiscal_week_nbr,gross_sales_amt,gross_transaction_cnt,class_code_id,subclass_id,subclass_gross_sales_amt
0,1,2018-09-08,31,98971.55,2389,11001,2,468.09
1,1,2018-09-08,31,98971.55,2389,11001,4,17.34

In [6]:
daily_data=pd.read_table("/home/jian/BigLots/MediaStorm_2018-09-08/MediaStormDailySales20180911-120816-779.txt",nrows=100,sep="|")
daily_data.head(3)

,location_id,transaction_dt,transaction_id,customer_id_hashed,class_code_id,subclass_id,subclass_transaction_units,subclass_transaction_amt
0,4586,2018-09-02,2643,NaN,12004,3,1,3.0
1,4669,2018-09-03,9443,NaN,11001,3,2,1.7
2,5236,2018-09-07,6231,NaN,11003,14,2,3.2

In [7]:
rewards_data=pd.read_table("/home/jian/BigLots/MediaStorm_2018-09-08/MediaStormSalesBiWeekly20180911-133008-590.txt",nrows=100,sep="|")
rewards_data.head(5)

,customer_id_hashed,transaction_dt,transaction_time,transaction_id,location_id,total_transaction_amt,total_transaction_units,merch_cat
0,78529f1faaf55eda95c929ae3423447504250c5c3f617d...,2018-09-02,11:06,8761,1997,36.05,14.0,11007006
1,5deef9a7a81fa5148ce58ad784d04e4c4d915a11389e6a...,2018-08-28,15:16,1764,371,8.00,2.0,12002001
2,46810561db834ebea9041d2ef57aa2b06de905b5e98968...,2018-09-07,11:17,4530,4247,637.70,11.0,61501002
3,0b788371c038fe1c09ed1ffb3f82d156d850903340b3b5...,2018-08-26,10:24,6752,428,66.59,9.0,21034003
4,6b7f473465293a7704fc6a153e71951a10c019bdd0a3d2...,2018-08-30,17:33,2550,1917,91.80,13.0,35047002